Revit 2027 API
AnnotationFamilyUtils.HasExcludeFromLeaderOutline Method
 Checks if the element supports the EXCLUDE_FROM_LEADER_OUTLINE parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool HasExcludeFromLeaderOutline(
	Element element
)
Public Shared Function HasExcludeFromLeaderOutline (
	element As Element
) As Boolean
public:
static bool HasExcludeFromLeaderOutline(
	Element^ element
)
static member HasExcludeFromLeaderOutline :
        element : Element -> bool
Parameters
element Element
 The element to check.
Return Value
Boolean
 True if the element has the EXCLUDE_FROM_LEADER_OUTLINE parameter, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 Only some elements in annotation families have the EXCLUDE_FROM_LEADER_OUTLINE parameter.
See Also
Reference
AnnotationFamilyUtils Class
Autodesk.Revit.DB Namespace